In [1]:
import pandas as pd

In [2]:
df = pd.read_excel(r"C:\Users\PC World\OneDrive\Desktop\data.xlsx")

In [3]:
df

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [4]:
df.shape

(195, 5)

In [5]:
df.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

In [6]:
len(df.columns)

5

In [8]:
len(df)

195

In [9]:
df.isnull()

     CountryName  CountryCode  BirthRate  InternetUsers  IncomeGroup
0          False        False      False          False        False
1          False        False      False          False        False
2          False        False      False          False        False
3          False        False      False          False        False
4          False        False      False          False        False
..           ...          ...        ...            ...          ...
190        False        False      False          False        False
191        False        False      False          False        False
192        False        False      False          False        False
193        False        False      False          False        False
194        False        False      False          False        False

[195 rows x 5 columns]

In [10]:
df.isna()

     CountryName  CountryCode  BirthRate  InternetUsers  IncomeGroup
0          False        False      False          False        False
1          False        False      False          False        False
2          False        False      False          False        False
3          False        False      False          False        False
4          False        False      False          False        False
..           ...          ...        ...            ...          ...
190        False        False      False          False        False
191        False        False      False          False        False
192        False        False      False          False        False
193        False        False      False          False        False
194        False        False      False          False        False

[195 rows x 5 columns]

In [11]:
df.isnull().sum()

CountryName      0
CountryCode      0
BirthRate        0
InternetUsers    0
IncomeGroup      0
dtype: int64

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CountryName    195 non-null    object
 1   CountryCode    195 non-null    object
 2   BirthRate      195 non-null    float64
 3   InternetUsers  195 non-null    float64
 4   IncomeGroup    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [13]:
df[:]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [14]:
df[::-1]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
194,Zimbabwe,ZWE,35.715,18.5,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
191,South Africa,ZAF,20.850,46.5,Upper middle income
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
...,...,...,...,...,...
4,United Arab Emirates,ARE,11.044,88.0,High income
3,Albania,ALB,12.877,57.2,Upper middle income
2,Angola,AGO,45.985,19.1,Upper middle income
1,Afghanistan,AFG,35.253,5.9,Low income
0,Aruba,ABW,10.244,78.9,High income

In [15]:
df.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [16]:
df.tail()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [17]:
df[0:200:30]

    CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
0         Aruba         ABW     10.244          78.90          High income
30       Canada         CAN     10.900          85.80          High income
60        Gabon         GAB     30.555           9.20  Upper middle income
90   Kazakhstan         KAZ     22.730          54.00  Upper middle income
120  Mozambique         MOZ     39.705           5.40           Low income
150       Sudan         SDN     33.477          22.70  Lower middle income
180     Uruguay         URY     14.374          57.69          High income

In [18]:
df[0:200:50]

    CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
0         Aruba         ABW     10.244      78.900000          High income
50      Ecuador         ECU     21.070      40.353684  Upper middle income
100       Libya         LBY     21.425      16.500000  Upper middle income
150       Sudan         SDN     33.477      22.700000  Lower middle income

In [19]:
df[50:101]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
50,Ecuador,ECU,21.070,40.353684,Upper middle income
51,"Egypt, Arab Rep.",EGY,28.032,29.400000,Lower middle income
52,Eritrea,ERI,34.800,0.900000,Low income
53,Spain,ESP,9.100,71.635000,High income
54,Estonia,EST,10.300,79.400000,High income
55,Ethiopia,ETH,32.925,1.900000,Low income
56,Finland,FIN,10.700,91.514400,High income
57,Fiji,FJI,20.463,37.100000,Upper middle income
58,France,FRA,12.300,81.919800,High income
59,"Micronesia, Fed. Sts.",FSM,23.511,27.800000,Lower middle income
60,Gabon,GAB,30.555,9.200000,Upper middle income
61,United Kingdom,GBR,12.200,89.844100,High income
62,Georgia,GEO,13.332,43.300000,Lower middle income
63,Ghana,GHA,33.131,12.300000,Lower middle income
64,Guinea,GIN,37.337,1.600000,Low income
65,"Gambia, The",GMB,42.525,14.000000,Low income
66,Guinea-Bissau,GNB,37.503,3.100000,Low income
67,Equatorial Guinea,GNQ,35.362,16.400000,High income
68,Greece,GRC,8.500,59.866300,High income
69,Grenada,GRD,19.334,35.000000,Upper middle income
70,Greenland,GRL,14.500,65.800000,High income
71,Guatemala,GTM,27.465,19.700000,Lower middle income
72,Guam,GUM,17.389,65.400000,High income
73,Guyana,GUY,18.885,35.000000,Lower middle income
74,"Hong Kong SAR, China",HKG,7.900,74.200000,High income
75,Honduras,HND,21.593,17.800000,Lower middle income
76,Croatia,HRV,9.400,66.747600,High income
77,Haiti,HTI,25.345,10.600000,Low income
78,Hungary,HUN,9.200,72.643900,High income
79,Indonesia,IDN,20.297,14.940000,Lower middle income
80,India,IND,20.291,15.100000,Lower middle income
81,Ireland,IRL,15.000,78.247700,High income
82,"Iran, Islamic Rep.",IRN,17.900,29.950000,Upper middle income
83,Iraq,IRQ,31.093,9.200000,Upper middle income
84,Iceland,ISL,13.400,96.546800,High income
85,Israel,ISR,21.300,70.800000,High income
86,Italy,ITA,8.500,58.459300,High income
87,Jamaica,JAM,13.540,37.100000,Upper middle income
88,Jordan,JOR,27.046,41.000000,Upper middle income
89,Japan,JPN,8.200,89.710000,High income
90,Kazakhstan,KAZ,22.730,54.000000,Upper middle income
91,Kenya,KEN,35.194,39.000000,Lower middle income
92,Kyrgyz Republic,KGZ,27.200,23.000000,Lower middle income
93,Cambodia,KHM,24.462,6.800000,Low income
94,Kiribati,KIR,29.044,11.500000,Lower middle income
95,"Korea, Rep.",KOR,8.600,84.770000,High income
96,Kuwait,KWT,20.575,75.460000,High income
97,Lao PDR,LAO,27.051,12.500000,Lower middle income
98,Lebanon,LBN,13.426,70.500000,Upper middle income
99,Liberia,LBR,35.521,3.200000,Low income
100,Libya,LBY,21.425,16.500000,Upper middle income

In [20]:
df.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

In [23]:
df['CountryName']

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: CountryName, Length: 195, dtype: object

In [25]:
df[['CountryCode', 'BirthRate']]

    CountryCode  BirthRate
0           ABW     10.244
1           AFG     35.253
2           AGO     45.985
3           ALB     12.877
4           ARE     11.044
..          ...        ...
190         YEM     32.947
191         ZAF     20.850
192         COD     42.394
193         ZMB     40.471
194         ZWE     35.715

[195 rows x 2 columns]

In [27]:
df[['CountryName', 'CountryCode']]

              CountryName CountryCode
0                   Aruba         ABW
1             Afghanistan         AFG
2                  Angola         AGO
3                 Albania         ALB
4    United Arab Emirates         ARE
..                    ...         ...
190           Yemen, Rep.         YEM
191          South Africa         ZAF
192      Congo, Dem. Rep.         COD
193                Zambia         ZMB
194              Zimbabwe         ZWE

[195 rows x 2 columns]

In [28]:
pd.__version__

'2.2.3'

In [29]:
type(df)

pandas.core.frame.DataFrame